EDT/УТ/src/DataProcessors/ОткрытыеСамовывозы_не_используется/ОткрытыеСамовывозы_не_используется.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОткрытыеСамовывозы_не_используется</name>
</mdclass:DataProcessor>

EDT/УТ/src/AccumulationRegisters/ЗакрытыеЗаказы/ЗакрытыеЗаказы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗакрытыеЗаказы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаОценочная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаПолученная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДоставкиДоМКАД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДоставкиЗаМКАД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УслугиСД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БанковскаяКомиссия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КассовоеОбслуживание</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВозврата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Масса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаЧастичногоВозврата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОплаченоКлиентовНал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АгентскоеВознаграждение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПредоплатаПоКредиту</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УслугиСДЧистые</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтраховойСбор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФактическийВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбъемЗабора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбъемЗабораПоЗаказам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыгруженныйОбъем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТарифицируемыйВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьОценочнаяПоТоварно</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПереносовСЗаездами</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьПереносовСЗаездами</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьПодъемаМП</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоТарифицируемыхРейсов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВознаграждениеАгентаПоПредоплаченнымЗаказам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФрахтЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТарифицируемыйОбъемныйВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Поступление</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Списание</name>
    <type>
      <types>DocumentRef.СписаниеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Оприходование</name>
    <type>
      <types>DocumentRef.ОприходованиеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Перемещение</name>
    <type>
      <types>DocumentRef.ПеремещениеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставка</name>
    <type>
      <types>BusinessProcessRef.новаМестнаяДоставка</types>
    </type>
  </attributes>
  <attributes>
    <name>Возврат</name>
    <type>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакВозврата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценочнаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Корректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТарификацияПоОбъемномуВесу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЮрЛицо</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗаказа</name>
    <type>
      <types>EnumRef.ТипыЗаказов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнтернетМагазин</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияДоставки</name>
    <type>
      <types>CatalogRef.КатегорииДоставки2014</types>
      <types>CatalogRef.КатегорииДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Экспедитор</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реализация</name>
    <type>
      <types>DocumentRef.ЗаборТовара</types>
      <types>DocumentRef.Фрахт</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипОплаты</name>
    <type>
      <types>CatalogRef.ТипыОплат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусЗаказа</name>
    <type>
      <types>CatalogRef.новаРезультатМестнойДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаНевыполнения</name>
    <type>
      <types>CatalogRef.ПричиныНеВыполненияДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусИнтернетМагазина</name>
    <type>
      <types>CatalogRef.СтатусЗаказаИнтернетМагазина</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаОтказа</name>
    <type>
      <types>CatalogRef.ПричиныОтказаПереноса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>VIPДоставка</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидVip</name>
    <type>
      <types>CatalogRef.ВидыVip</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТарифнаяСетка</name>
    <type>
      <types>CatalogRef.ТипыТарифов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РасчетныйБрейк</name>
    <type>
      <types>CatalogRef.РасчетныеБрейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТарифнаяСеткаПартнера</name>
    <type>
      <types>CatalogRef.ТарифныеСетки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗонаТарификации</name>
    <type>
      <types>CatalogRef.ГруппыРайонов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаОтклоненияЗаказа</name>
    <comment>Причина отклонения заказа в системе</comment>
    <type>
      <types>CatalogRef.ПричиныОтклоненияЗаказаВСистеме</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТерминалДоставки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТерминалПриёма</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъемныйБрейк</name>
    <type>
      <types>CatalogRef.ОбъемныеБрейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодъемныйБрейк</name>
    <type>
      <types>CatalogRef.ВесовыеБрейкиРасчетаСтоимостиПодъемов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/DataProcessors/ОткрытыеСамовывозы_не_используется/ObjectModule.bsl
Функция ОбновитьДанные() Экспорт
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	РеализацияТоваровУслуг.Ссылка КАК Реализация,
	            |	ЕСТЬNULL(новаМестнаяДоставка.Ссылка, ИСТИНА) КАК ЭтоСамовывоз
	            |ПОМЕСТИТЬ ВТЗаказы
	            |ИЗ
	            |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	            |		ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.новаМестнаяДоставка КАК новаМестнаяДоставка
	            |		ПО РеализацияТоваровУслуг.Номер = новаМестнаяДоставка.Номер
	            |ГДЕ
	            |	РеализацияТоваровУслуг.Дата >= ДАТАВРЕМЯ(2013, 11, 1)
	            |	И РеализацияТоваровУслуг.СтатусИнтернетМагазина = 2
	            |	И РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	ВТЗаказы.Реализация,
	            |	ЕСТЬNULL(ЗакрытыеЗаказы.Регистратор, ИСТИНА) КАК Открыт
	            |ПОМЕСТИТЬ ВТСамовывоз
	            |ИЗ
	            |	ВТЗаказы КАК ВТЗаказы
	            |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗакрытыеЗаказы КАК ЗакрытыеЗаказы
	            |		ПО ВТЗаказы.Реализация.Ссылка = ЗакрытыеЗаказы.Реализация.Ссылка
	            |ГДЕ
	            |	ВТЗаказы.ЭтоСамовывоз = ИСТИНА
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	ВТСамовывоз.Реализация КАК Самовывоз,
	            |	ВТСамовывоз.Реализация.Номер КАК Номер,
	            |	ВТСамовывоз.Реализация.НомерВнешнегоЗаказа КАК НомерВнешнегоЗаказа,
	            |	ВТСамовывоз.Реализация.Контрагент.Наименование КАК Клиент,
	            |	ВТСамовывоз.Реализация.Дата КАК Дата
	            |ИЗ
	            |	ВТСамовывоз КАК ВТСамовывоз
	            |ГДЕ
	            |	ВТСамовывоз.Открыт = ИСТИНА
	            |
	            |УПОРЯДОЧИТЬ ПО
	            |	ВТСамовывоз.Реализация.Дата,
	            |	ВТСамовывоз.Реализация.Номер
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |УНИЧТОЖИТЬ ВТЗаказы
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |УНИЧТОЖИТЬ ВТСамовывоз";
				
	  Возврат Зап.Выполнить();
  КонецФункции
  
  

Функция ОбновитьДанныеПоКлиенту(Клиент) Экспорт
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	РеализацияТоваровУслуг.Ссылка КАК Реализация,
	            |	ЕСТЬNULL(новаМестнаяДоставка.Ссылка, ИСТИНА) КАК ЭтоСамовывоз
	            |ПОМЕСТИТЬ ВТЗаказы
	            |ИЗ
	            |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	            |		ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.новаМестнаяДоставка КАК новаМестнаяДоставка
	            |		ПО РеализацияТоваровУслуг.Номер = новаМестнаяДоставка.Номер
	            |ГДЕ
	            |	РеализацияТоваровУслуг.Дата >= ДАТАВРЕМЯ(2013, 11, 1)
	            |	И РеализацияТоваровУслуг.СтатусИнтернетМагазина = 2
	            |	И РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	ВТЗаказы.Реализация,
	            |	ЕСТЬNULL(ЗакрытыеЗаказы.Регистратор, ИСТИНА) КАК Открыт
	            |ПОМЕСТИТЬ ВТСамовывоз
	            |ИЗ
	            |	ВТЗаказы КАК ВТЗаказы
	            |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗакрытыеЗаказы КАК ЗакрытыеЗаказы
	            |		ПО ВТЗаказы.Реализация.Ссылка = ЗакрытыеЗаказы.Реализация.Ссылка
	            |ГДЕ
	            |	ВТЗаказы.ЭтоСамовывоз = ИСТИНА
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	ВТСамовывоз.Реализация КАК Самовывоз,
	            |	ВТСамовывоз.Реализация.Номер КАК Номер,
	            |	ВТСамовывоз.Реализация.НомерВнешнегоЗаказа КАК НомерВнешнегоЗаказа,
	            |	ВТСамовывоз.Реализация.Контрагент.Наименование КАК Клиент,
	            |	ВТСамовывоз.Реализация.Дата КАК Дата,
	            |	ВТСамовывоз.Реализация.ВладелецТовара КАК Магазин
	            |ИЗ
	            |	ВТСамовывоз КАК ВТСамовывоз
	            |ГДЕ
	            |	ВТСамовывоз.Открыт = ИСТИНА
	            |	И ВТСамовывоз.Реализация.Контрагент.Наименование ПОДОБНО &Клиент
	            |
	            |УПОРЯДОЧИТЬ ПО
	            |	ВТСамовывоз.Реализация.Дата,
	            |	ВТСамовывоз.Реализация.Номер,
	            |	Клиент
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |УНИЧТОЖИТЬ ВТЗаказы
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |УНИЧТОЖИТЬ ВТСамовывоз";
		Зап.УстановитьПараметр("Клиент", "%" + Клиент + "%");		
	  Возврат Зап.Выполнить();
  КонецФункции
